---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.HostSseCurvedEdgeConditionParam
source: html/c8cefbac-86aa-c390-87f4-0e2e34d064ba.htm
---
# Autodesk.Revit.DB.ParameterTypeId.HostSseCurvedEdgeConditionParam Property

"Curved Edge Condition"

## Syntax (C#)
```csharp
public static ForgeTypeId HostSseCurvedEdgeConditionParam { get; }
```